app/helpers/session_helper.rb

  def check_token
    token = request.headers['Authorization'].split(' ') # Para el token quitando el bearer
    player = Player.find_by(token: token[1]) # En token[0] queda "Bearer"
---
SELECT "players".* FROM "players" WHERE "players"."token" = $1 LIMIT $2  [["token", "4ae11e6c-97c8-4b16-9203-9e7fc62648b2"], ["LIMIT", 1]]