app/controllers/boards_controller.rb

  def index
    board = Board.all
---
SELECT "boards".* FROM "boards"

  def show
    board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @player1 = Player.find(params[:board][:player1_id])
    deck = Deck.create(content: CardEnum::CARD_ENUM_VALUES.dup.shuffle)
    board = Board.new(board_name: params[:board][:board_name],
                      player1_id: @player1.id,
                      deck_id: deck.id)
    board.deck = deck

    if board.save
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", "c493ecc7-0c31-4e90-aff8-1c2cce44049b"], ["LIMIT", 1]]
INSERT INTO "boards" ("player1_id", "player2_id", "board_name", "winner", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["player1_id", 81], ["player2_id", nil], ["board_name", "Nombre_del_Tablero"], ["winner", nil], ["created_at", "2023-10-15 20:57:46.476457"], ["updated_at", "2023-10-15 20:57:46.476457"]]

  def destroy
    board = Board.find(params[:id])
    board.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "b83b65f1-5e32-42ef-9e8d-0e8f6fcad90b"], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", "2bba218f-d648-48d6-a89f-1191bf3f4bbe"]]

  def update
    board = Board.find(params[:id])
    if board.update(board_params)
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "b83b65f1-5e32-42ef-9e8d-0e8f6fcad90b"], ["LIMIT", 1]]
UPDATE "boards" SET "board_name" = $1, "winner" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["board_name", "Nuevo_Nombre_del_Tablero"], ["winner", 1], ["updated_at", "2023-10-15 21:22:50.544438"], ["id", "ecb4896c-f747-492f-b7f7-48346eef2b41"]]

  def join_board
    @player2 = Player.find(params[:board][:player2_id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]