app/controllers/boards_controller.rb

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_players(board)
    @player1 = Player.find(board.player1_id)