app/controllers/players_controller.rb

SELECT "players".* FROM "players" WHERE "players"."email" = $1 AND "players"."password" = $2 LIMIT $3  [["email", "lucasdavidmiranda8@hotmail.com"], ["password", "123456#"], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."nickname" IS NULL AND "players"."password" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "players" WHERE "players"."email" = $1 LIMIT $2  [["email", "lucasdavidmiranda8@hotmail.com"], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE ((email = 'lucasdavidmiranda8@hotmail.com' OR nickname = NULL) AND password = '123456#') LIMIT $1  [["LIMIT", 1]]
---
  def login
    player = Player.find_by('(email = :email OR nickname = :nickname) AND password = :password',
                            { email: params[:player][:email],
                              nickname: params[:player][:nickname],
                              password: params[:player][:password] })
    if player.present?
      token = player.token if player.token.present?

INSERT INTO "players" ("name", "lastname", "password", "nickname", "email", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    player = Player.new(player_params)

    # Imagen por defecto para el player
    player.image.attach(io: File.open(Rails.root.join('public', 'images', 'null_profile.png')),
                        filename: 'null_profile.png',
                        content_type: 'image/png')

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", "c94a6e5a-2ec6-409f-8993-11a5d070890c"], ["LIMIT", 1]]
---
  def update
    player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", "4e37a174-42be-4509-939c-4e8df15eab76"], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", "c94a6e5a-2ec6-409f-8993-11a5d070890c"]]
---
  def destroy
    player = Player.find(params[:id])
    player.image.purge if player.image.attached?

    if player.destroy

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", "4e37a174-42be-4509-939c-4e8df15eab76"], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "images" ("created_at", "updated_at", "player_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2023-10-13 18:51:42.376392"], ["updated_at", "2023-10-13 18:51:42.376392"], ["player_id", "4dc86b4e-6e3e-4f70-b439-cffe72b513ec"]]
UPDATE "images" SET "updated_at" = $1 WHERE "images"."id" = $2  [["updated_at", "2023-10-13 18:51:42.401465"], ["id", "4825e432-c0a3-4bfe-a0e3-b2c4719cd2f1"]]
---
  def update_image
    player = Player.find(params[:player_id])
    image_params = params[:image]

    if player.image.present? && params[:image].present?
      player.image.purge # Elimina el archivo adjunto existente
    end

    player.image.attach(image_params)

    if player.save